---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.WireDiameterTooLarge
source: html/ad80d7c1-71a0-df07-3f3e-c243978ea397.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.WireDiameterTooLarge Property

Fabric Wire Diameter is too large.

## Syntax (C#)
```csharp
public static FailureDefinitionId WireDiameterTooLarge { get; }
```